Repository: EL-BID/PlataformaTransparencia
Catalog: MapaInversiones.Web/Localization/*/OrchardCore.Infrastructure.po
Languages: de, el, fa

# OrchardCore.Environment.Commands.CommandHostAgent
source: Error executing command "***REMOVED***0***REMOVED***"
de: Fehler beim Ausführen des Befehls "***REMOVED***0***REMOVED***"
el: Σφάλμα κατά την εκτέλεση της εντολής "***REMOVED***0***REMOVED***"
fa: خطا هنگام اجرای فرمان "***REMOVED***0***REMOVED***"

# OrchardCore.Environment.Commands.CommandHostAgent
source: Exception Details: ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***
de: Ausnahmedetails: ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***
el: Λεπτομέρειες εξαίρεσης: ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***
fa: جزئیات خطا: ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***

# OrchardCore.Environment.Commands.CommandHostAgent
source: Stack Trace:
el: Ιχνηλάτηση στοίβας:
fa: ردیابی پشته:

# OrchardCore.Environment.Commands.CommandHostAgent
source: Tenant ***REMOVED***0***REMOVED*** does not exist
de: Mandant ***REMOVED***0***REMOVED*** existiert nicht
el: Ο ενοικιαστής ***REMOVED***0***REMOVED*** δεν υπάρχει
fa: تِنِنت (tenant) به عنوان ***REMOVED***0***REMOVED*** وجود ندارد

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Switch "***REMOVED***0***REMOVED***" was not found
de: Schalter "***REMOVED***0***REMOVED***" wurde nicht gefunden
el: Η εναλλαγή "***REMOVED***0***REMOVED***" δεν βρέθηκε
fa: سوئیچ "***REMOVED***0***REMOVED***" یافت نشد

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: A property "***REMOVED***0***REMOVED***" exists but is not decorated with "***REMOVED***1***REMOVED***"
de: Eine Eigenschaft "***REMOVED***0***REMOVED***" existiert, ist aber nicht mit "***REMOVED***1***REMOVED*** " gekennzeichnet
el: Μια ιδιότητα "***REMOVED***0***REMOVED***" υπάρχει αλλά δεν είναι διακοσμημένη με "***REMOVED***1***REMOVED***"
fa: Property (ویژگی) "***REMOVED***0***REMOVED***" وجود دارد اما با "***REMOVED***1***REMOVED***" decorate نشده است

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Error converting value "***REMOVED***0***REMOVED***" to "***REMOVED***1***REMOVED***" for switch "***REMOVED***2***REMOVED***"
de: Fehler beim Konvertieren des Wertes "***REMOVED***0***REMOVED***" in "***REMOVED***1***REMOVED***" für Schalter "***REMOVED***2***REMOVED***"
el: Σφάλμα μετατροπής της τιμής "***REMOVED***0***REMOVED***" σε "***REMOVED***1***REMOVED***" για εναλλαγή "***REMOVED***2***REMOVED***"
fa: خطا هنگام تبدیل مقدار "***REMOVED***0***REMOVED***" به "***REMOVED***1***REMOVED***" برای سوییچ "***REMOVED***2***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Command arguments "***REMOVED***0***REMOVED***" don't match command definition
de: Befehlsargumente "***REMOVED***0***REMOVED***" stimmen nicht mit der Befehlsdefinition überein
el: Τα επιχειρήματα "***REMOVED***0***REMOVED***" της εντολής δεν ταιριάζουν με τον ορισμό της εντολής
fa: آرگومان‌های دستور "***REMOVED***0***REMOVED***" با تعریف دستور مطابقت ندارند

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Method "***REMOVED***0***REMOVED***" does not support switch "***REMOVED***1***REMOVED***".
de: Methode "***REMOVED***0***REMOVED***" unterstützt keinen Schalter "***REMOVED***1***REMOVED***".
el: Η μέθοδος "***REMOVED***0***REMOVED***" δεν υποστηρίζει την εναλλαγή "***REMOVED***1***REMOVED***".
fa: متود "***REMOVED***0***REMOVED***" از سوییچ "***REMOVED***1***REMOVED***" پشتیبانی نمی‌کند.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: Multiple commands found matching arguments "***REMOVED***0***REMOVED***". Commands available: ***REMOVED***1***REMOVED***.
de: Mehrere Befehle gefunden für Argumente "***REMOVED***0***REMOVED***". Verfügbare Befehle: ***REMOVED***1***REMOVED***.
el: Πολλαπλές εντολές βρήκαν αντιστοίχιση των επιχειρήματων "***REMOVED***0***REMOVED***". Διαθέσιμες εντολές: ***REMOVED***1***REMOVED***.
fa: چندین دستور که با آرگومان‌های "***REMOVED***0***REMOVED***" مطابقت دارند، پیدا شد. دستورهای موجود: ***REMOVED***1***REMOVED***.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: No command found matching arguments "***REMOVED***0***REMOVED***". Commands available: ***REMOVED***1***REMOVED***.
de: Kein Befehl wurde zu den Argumenten "***REMOVED***0***REMOVED***" gefunden. Befehle verfügbar: ***REMOVED***1***REMOVED***.
el: Δεν βρέθηκε εντολή που να ταιριάζει με τα επιχειρήματα "***REMOVED***0***REMOVED***". Διαθέσιμες εντολές: ***REMOVED***1***REMOVED***.
fa: هیچ دستوری که با آرگومان‌های "***REMOVED***0***REMOVED***" مطابقت داشته باشد، پیدا نشد. فرمان‌های موجود: ***REMOVED***1***REMOVED***.

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: List of available commands:
de: Liste der verfügbaren Befehle:
el: Λίστα διαθέσιμων εντολών:
fa: لیست دستورات موجود:

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: Command ***REMOVED***0***REMOVED*** doesn't exist
de: Befehl ***REMOVED***0***REMOVED*** existiert nicht
el: Η εντολή ***REMOVED***0***REMOVED*** δεν υπάρχει
fa: دستور ***REMOVED***0***REMOVED*** وجود ندارد

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED***: no help text
de: ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED***: kein Hilfetext
el: ***REMOVED***0***REMOVED***. ***REMOVED***1***REMOVED***: κανένα κείμενο βοήθειας
fa: ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED***: متن راهنما وجود ندارد
