Repository: EL-BID/PlataformaTransparencia
Catalog: MapaInversiones.Web/Localization/*/OrchardCore.Localization.Core.po
Languages: it

# OrchardCore.Localization.Core.DataAnnotations
source: The ***REMOVED***0***REMOVED*** field is required.
it: Il campo ***REMOVED***0***REMOVED*** è obbligatorio.

source: The associated metadata type for type '***REMOVED***0***REMOVED***' contains the following unknown properties or fields: ***REMOVED***1***REMOVED***. Please make sure that the names of these members match the names of the properties on the main type.
it: Il tipo di metadati associato per il tipo «***REMOVED***0***REMOVED***» contiene le seguenti proprietà o campi sconosciuti: ***REMOVED***1***REMOVED***. Assicurarsi che i nomi di questi membri corrispondano ai nomi delle proprietà sul tipo principale.

source: The type '***REMOVED***0***REMOVED***' does not contain a public property named '***REMOVED***1***REMOVED***'.
it: Il tipo '***REMOVED***0***REMOVED***' non contiene una proprietà pubblica chiamata '***REMOVED***1***REMOVED***'.

source: The property ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED*** could not be found.
it: La proprietà ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED*** non è stata trovata.

source: '***REMOVED***0***REMOVED***' and '***REMOVED***1***REMOVED***' do not match.
it: '***REMOVED***0***REMOVED***' e '***REMOVED***1***REMOVED***' non corrispondono.

source: Could not find a property named ***REMOVED***0***REMOVED***.
it: Impossibile trovare una proprietà denominata ***REMOVED***0***REMOVED***.

source: The ***REMOVED***0***REMOVED*** field is not a valid credit card number.
it: Il campo ***REMOVED***0***REMOVED*** non è un numero di carta di credito valido.

source: The CustomValidationAttribute method '***REMOVED***0***REMOVED***' in type '***REMOVED***1***REMOVED***' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
it: Il metodo CustomValidationAttribute '***REMOVED***0***REMOVED***' nel tipo '***REMOVED***1***REMOVED***' deve restituire System.ComponentModel.DataAnnotations.ValidationResult. Utilizzare System.ComponentModel.DataAnnotations.ValidationResult.Success per indicare un operazione completata con successo.

source: The CustomValidationAttribute method '***REMOVED***0***REMOVED***' does not exist in type '***REMOVED***1***REMOVED***' or is not public and static.
it: Il metodo CustomValidationAttribute '***REMOVED***0***REMOVED***' non esiste nel tipo '***REMOVED***1***REMOVED***' o non è pubblico e statico.

source: The CustomValidationAttribute.Method was not specified.
it: Il metodo CustomValidationAttribute.Method non è stato specificato.

source: The CustomValidationAttribute method '***REMOVED***0***REMOVED***' in type '***REMOVED***1***REMOVED***' must match the expected signature: public static ValidationResult ***REMOVED***0***REMOVED***(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
it: Il metodo CustomValidationAttribute '***REMOVED***0***REMOVED***' nel tipo '***REMOVED***1***REMOVED***' deve corrispondere alla definizione: public static ValidationResult ***REMOVED***0***REMOVED***(object value, ValidationContext context). L'argomento value può essere tipicizzato. Il parametro ValidationContext è opzionale.

source: Could not convert the value of type '***REMOVED***0***REMOVED***' to '***REMOVED***1***REMOVED***' as expected by method ***REMOVED***2***REMOVED***.***REMOVED***3***REMOVED***.
it: Impossibile convertire il valore di tipo '***REMOVED***0***REMOVED***' in '***REMOVED***1***REMOVED***' come previsto dal metodo ***REMOVED***2***REMOVED***.***REMOVED***3***REMOVED***.

source: The custom validation type '***REMOVED***0***REMOVED***' must be public.
it: Il tipo di validazione personalizzato '***REMOVED***0***REMOVED***' deve essere pubblico.

source: ***REMOVED***0***REMOVED*** is not valid.
it: ***REMOVED***0***REMOVED*** non è valido.

source: The CustomValidationAttribute.ValidatorType was not specified.
it: Il CustomValidationAttribute.ValidatorType non è stato specificato.

source: The custom DataType string cannot be null or empty.
it: La stringa DataType personalizzata non può essere nulla o vuota.

source: The ***REMOVED***0***REMOVED*** property has not been set. Use the ***REMOVED***1***REMOVED*** method to get the value.
it: La proprietà ***REMOVED***0***REMOVED*** non è stata impostata. Usa il metodo ***REMOVED***1***REMOVED*** per ottenere il valore.

source: The ***REMOVED***0***REMOVED*** field is not a valid e-mail address.
it: Il campo ***REMOVED***0***REMOVED*** non è un indirizzo e-mail valido.

source: The type provided for EnumDataTypeAttribute cannot be null.
it: Il tipo fornito per EnumDataTypeAttribute non può essere nullo.

source: The type '***REMOVED***0***REMOVED***' needs to represent an enumeration type.
it: Il tipo '***REMOVED***0***REMOVED***' deve rappresentare un tipo enumerator.

source: The ***REMOVED***0***REMOVED*** field only accepts files with the following extensions: ***REMOVED***1***REMOVED***.
it: Il campo ***REMOVED***0***REMOVED*** accetta solo file con le seguenti estensioni: ***REMOVED***1***REMOVED***.

source: Cannot retrieve property '***REMOVED***0***REMOVED***' because localization failed. Type '***REMOVED***1***REMOVED***' is not public or does not contain a public static string property with the name '***REMOVED***2***REMOVED***'.
it: Impossibile recuperare la proprietà '***REMOVED***0***REMOVED***' perché la localizzazione non è riuscita. Il tipo «***REMOVED***1***REMOVED***» non è pubblico o non contiene una proprietà di stringa statica pubblica con il nome «***REMOVED***2***REMOVED***».

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
it: MaxLengthAttribute deve avere un valore di lunghezza maggiore di zero. Usa MaxLength() senza parametri per indicare che la stringa o l'array può avere una lunghezza massima consentita.

source: The field ***REMOVED***0***REMOVED*** must be a string or array type with a maximum length of '***REMOVED***1***REMOVED***'.
it: Il campo ***REMOVED***0***REMOVED*** deve essere una stringa o un tipo di array con una lunghezza massima di '***REMOVED***1***REMOVED***'.

source: MetadataClassType cannot be null.
it: MetadataClassType non può essere nullo.

source: MinLengthAttribute must have a Length value that is zero or greater.
it: MinLengthAttribute deve avere un valore di lunghezza pari o superiore a zero.

source: The field ***REMOVED***0***REMOVED*** must be a string or array type with a minimum length of '***REMOVED***1***REMOVED***'.
it: Il campo ***REMOVED***0***REMOVED*** deve essere una stringa o un tipo di array con una lunghezza minima di '***REMOVED***1***REMOVED***'.

source: The field of type ***REMOVED***0***REMOVED*** must be a string, array or ICollection type.
it: Il campo di tipo ***REMOVED***0***REMOVED*** deve essere un tipo di stringa, array o ICollection.

source: The ***REMOVED***0***REMOVED*** field is not a valid phone number.
it: Il campo ***REMOVED***0***REMOVED*** non è un numero di telefono valido.

source: The type ***REMOVED***0***REMOVED*** must implement ***REMOVED***1***REMOVED***.
it: Il tipo ***REMOVED***0***REMOVED*** deve implementare ***REMOVED***1***REMOVED***.

source: The maximum value '***REMOVED***0***REMOVED***' must be greater than or equal to the minimum value '***REMOVED***1***REMOVED***'.
it: Il valore massimo '***REMOVED***0***REMOVED***' deve essere maggiore o uguale al valore minimo '***REMOVED***1***REMOVED***'.

source: The minimum and maximum values must be set.
it: Devono essere fissati i valori minimi e massimi.

source: The OperandType must be set when strings are used for minimum and maximum values.
it: Il OperandType deve essere impostato quando le stringhe sono utilizzate per valori minimi e massimi.

source: The field ***REMOVED***0***REMOVED*** must be between ***REMOVED***1***REMOVED*** and ***REMOVED***2***REMOVED***.
it: Il campo "***REMOVED***0***REMOVED***" deve essere compreso fra ***REMOVED***1***REMOVED*** e ***REMOVED***2***REMOVED***.

source: The field ***REMOVED***0***REMOVED*** must match the regular expression '***REMOVED***1***REMOVED***'.
it: Il campo ***REMOVED***0***REMOVED*** deve corrispondere all'espressione regolare '***REMOVED***1***REMOVED***'.

source: The pattern must be set to a valid regular expression.
it: Il modello deve essere impostato con un'espressione regolare valida.

source: The ***REMOVED***0***REMOVED*** field is required.
it: Il campo ***REMOVED***0***REMOVED*** è obbligatorio.

source: The maximum length must be a nonnegative integer.
it: La lunghezza massima deve essere un numero intero non negativo.

source: The field ***REMOVED***0***REMOVED*** must be a string with a maximum length of ***REMOVED***1***REMOVED***.
it: Il campo ***REMOVED***0***REMOVED*** deve essere una stringa con una lunghezza massima di '***REMOVED***1***REMOVED***.

source: The field ***REMOVED***0***REMOVED*** must be a string with a minimum length of ***REMOVED***2***REMOVED*** and a maximum length of ***REMOVED***1***REMOVED***.
it: Il campo ***REMOVED***0***REMOVED*** deve essere una stringa con una lunghezza minima di ***REMOVED***2***REMOVED*** e una lunghezza massima di ***REMOVED***1***REMOVED***.

source: The key parameter at position ***REMOVED***0***REMOVED*** with value '***REMOVED***1***REMOVED***' is not a string. Every key control parameter must be a string.
it: Il parametro chiave ***REMOVED***0***REMOVED*** valorizzato con '***REMOVED***1***REMOVED***' non è una stringa. Ogni parametro di controllo chiave deve essere una stringa.

source: The key parameter at position ***REMOVED***0***REMOVED*** is null. Every key control parameter must be a string.
it: Il parametro chiave ***REMOVED***0***REMOVED*** valorizzato è nullo. Ogni parametro di controllo chiave deve essere una stringa.

source: The key parameter at position ***REMOVED***0***REMOVED*** with value '***REMOVED***1***REMOVED***' occurs more than once.
it: Il parametro chiave alla posizione ***REMOVED***0***REMOVED*** con valore '***REMOVED***1***REMOVED***' è presente più di una volta.

source: The number of control parameters must be even.
it: Il numero di parametri di controllo deve essere pari.

source: The ***REMOVED***0***REMOVED*** field is not a valid fully-qualified http, https, or ftp URL.
it: Il campo ***REMOVED***0***REMOVED*** non è un URL http, https o ftp fully-qualified valido.

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
it: O ErrorMessageString o ErrorMessageResourceName deve essere impostato, ma non entrambi.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
it: IsValid(object value) non è stato implementato da questa classe. L'entry point GetValidationResult() e le classi, dovrebbero sovrascrivere IsValid(object value, ValidationContext context).

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
it: Entrambi ErrorMessageResourceType e ErrorMessageResourceName devono essere impostati su questo attributo.

source: The property '***REMOVED***0***REMOVED***' on resource type '***REMOVED***1***REMOVED***' is not a string type.
it: La proprietà '***REMOVED***0***REMOVED***' sul tipo di risorsa '***REMOVED***1***REMOVED***' non è un tipo di stringa.

source: The resource type '***REMOVED***0***REMOVED***' does not have an accessible static property named '***REMOVED***1***REMOVED***'.
it: Il tipo di risorsa '***REMOVED***0***REMOVED***' non ha una proprietà statica accessibile chiamata '***REMOVED***1***REMOVED***'.

source: The field ***REMOVED***0***REMOVED*** is invalid.
it: Il campo '***REMOVED***0***REMOVED***' non è valido.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
it: L'istanza fornita deve corrispondere all' ObjectInstance nel ValidationContext fornito.

source: The value for property '***REMOVED***0***REMOVED***' must be of type '***REMOVED***1***REMOVED***'.
it: Il valore per la proprietà '***REMOVED***0***REMOVED***' deve essere di tipo '***REMOVED***1***REMOVED***'.
