Repository: EL-BID/PlataformaTransparencia
Catalog: PlataformaTransparencia.Web/Localization/*/OrchardCore.Infrastructure.po
Languages: fr

# OrchardCore.Environment.Commands.CommandHostAgent
source: Error executing command "***REMOVED***0***REMOVED***"
fr: Erreur en exécutant la commande "***REMOVED***0***REMOVED***"

# OrchardCore.Environment.Commands.CommandHostAgent
source: Exception Details: ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***
fr: Détails d'exception : ***REMOVED***0***REMOVED***: ***REMOVED***1***REMOVED***

# OrchardCore.Environment.Commands.CommandHostAgent
source: Stack Trace:
fr: État de la pile :

# OrchardCore.Environment.Commands.CommandHostAgent
source: Tenant ***REMOVED***0***REMOVED*** does not exist
fr: Le locataire ***REMOVED***0***REMOVED*** n'existe pas

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Switch "***REMOVED***0***REMOVED***" was not found
fr: Le switch "***REMOVED***0***REMOVED***" n'a pas été trouvé

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: A property "***REMOVED***0***REMOVED***" exists but is not decorated with "***REMOVED***1***REMOVED***"
fr: Une propriété "***REMOVED***0***REMOVED***" existe mais n'a pas été décorée avec "***REMOVED***1***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Error converting value "***REMOVED***0***REMOVED***" to "***REMOVED***1***REMOVED***" for switch "***REMOVED***2***REMOVED***"
fr: Erreur lors de la conversion de la valeur "***REMOVED***0***REMOVED***" à "***REMOVED***1***REMOVED***" pour le switch "***REMOVED***2***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Command arguments "***REMOVED***0***REMOVED***" don't match command definition
fr: Les arguments de commande "***REMOVED***0***REMOVED***" ne correspondent pas à la définition de la commande

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Method "***REMOVED***0***REMOVED***" does not support switch "***REMOVED***1***REMOVED***".
fr: La méthode "***REMOVED***0***REMOVED***" ne prend pas en charge le switch "***REMOVED***1***REMOVED***".

# OrchardCore.Environment.Commands.DefaultCommandManager
source: Multiple commands found matching arguments "***REMOVED***0***REMOVED***". Commands available: ***REMOVED***1***REMOVED***.
fr: Plusieurs commandes trouvées correspondants aux arguments "***REMOVED***0***REMOVED***". Commandes disponibles : ***REMOVED***1***REMOVED***.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: No command found matching arguments "***REMOVED***0***REMOVED***". Commands available: ***REMOVED***1***REMOVED***.
fr: Aucune commande trouvée correspondant aux arguments"***REMOVED***0***REMOVED***". Commandes disponibles : ***REMOVED***1***REMOVED***.

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: List of available commands:
fr: Liste des commandes disponibles :

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: Command ***REMOVED***0***REMOVED*** doesn't exist
fr: La commande ***REMOVED***0***REMOVED*** n'existe pas

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED***: no help text
fr: ***REMOVED***0***REMOVED***.***REMOVED***1***REMOVED***: aucun texte d'aide
